#ifndef _IMX6ULL_CON_H_
#define  _IMX6ULL_CON_H_

/**********************************************************************
 * 函数名称： Imx6ull_lcd_controller_add
 * 功能描述： 添加Imx6ull的lcd控制器
 * 输入参数： 无
 * 输出参数： 无
 * 返 回 值： 无
 * 修改日期        版本号     修改人	      修改内容
 * -----------------------------------------------
 * 2020/02/26	     V1.0	  zh(angenao)	      创建
 ***********************************************************************/                          ;
void Imx6ull_lcd_controller_add(void);


#endif


